app/controllers/contacto_controller.rb

  def create
    @dato = Dato.new(dato_params)

    respond_to do |format|
      if @dato.save
---
INSERT INTO `datos` (`name`, `email`, `phone`, `description`, `created_at`, `updated_at`) VALUES ('ok2', 'ok2', 321, 'ok2', '2020-05-22 20:47:00.643973', '2020-05-22 20:47:00.643973')