app/controllers/datos_controller.rb

SELECT `datos`.* FROM `datos`
---
  def index
    @datos = Dato.all

INSERT INTO `datos` (`name`, `email`, `phone`, `description`, `created_at`, `updated_at`) VALUES ('damian', 'dquiroz@somax.cl', 99867002, 'Hola', '2020-05-22 19:47:32.137147', '2020-05-22 19:47:32.137147')
---
  def create
    @dato = Dato.new(dato_params)

    respond_to do |format|
      if @dato.save

SELECT `datos`.* FROM `datos` WHERE `datos`.`id` = 1 LIMIT 1
---
    def set_dato
      @dato = Dato.find(params[:id])